; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p11)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 a3 - Aircraft
 c1 c2 c3 c4 c5 c6 c7 c8 c9 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c8)
(fuel-level a2 f2) (at a2 c1)
(fuel-level a3 f2) (at a3 c5)
(at p1 c7)
(at p2 c6)
(at p3 c6)
(at p4 c3)
(at p5 c2)
(at p6 c9)
(at p7 c3)
(at p8 c8)
(at p9 c5)
(at p10 c2)
(at p11 c4)
(at p12 c7)
(at p13 c5)
(at p14 c6)
(at p15 c2)
(at p16 c8)
(at p17 c2)
(at p18 c2)
)
(:goal (and
(at a1 c8)
(at a2 c1)
(at a3 c5)
(at p1 c8)
(at p2 c6)
(at p3 c2)
(at p4 c2)
(at p5 c7)
(at p6 c2)
(at p7 c2)
(at p8 c1)
(at p9 c8)
(at p10 c5)
(at p11 c9)
(at p12 c6)
(at p13 c9)
(at p14 c5)
(at p15 c9)
(at p16 c2)
(at p17 c6)
(at p18 c7)
))
)

; plan
1. (fly a1 c8 c7 f2 f1)
   deleted: (at a1 c8) (fuel-level a1 f2)
   added: (at a1 c7) (fuel-level a1 f1)
   goals met: 3 of 21
2. (board p1 a1 c7)
   deleted: (at p1 c7)
   added: (in p1 a1)
   goals met: 3 of 21
3. (fly a1 c7 c8 f1 f0)
   deleted: (at a1 c7) (fuel-level a1 f1)
   added: (at a1 c8) (fuel-level a1 f0)
   goals met: 4 of 21
4. (debark p1 a1 c8)
   deleted: (in p1 a1)
   added: (at p1 c8)
   goals met: 5 of 21
5. (fly a3 c5 c6 f2 f1)
   deleted: (at a3 c5) (fuel-level a3 f2)
   added: (at a3 c6) (fuel-level a3 f1)
   goals met: 4 of 21
6. (board p3 a3 c6)
   deleted: (at p3 c6)
   added: (in p3 a3)
   goals met: 4 of 21
7. (fly a3 c6 c2 f1 f0)
   deleted: (at a3 c6) (fuel-level a3 f1)
   added: (at a3 c2) (fuel-level a3 f0)
   goals met: 4 of 21
8. (debark p3 a3 c2)
   deleted: (in p3 a3)
   added: (at p3 c2)
   goals met: 5 of 21
9. (fly a2 c1 c3 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 4 of 21
10. (board p4 a2 c3)
   deleted: (at p4 c3)
   added: (in p4 a2)
   goals met: 4 of 21
11. (fly a2 c3 c2 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 4 of 21
12. (debark p4 a2 c2)
   deleted: (in p4 a2)
   added: (at p4 c2)
   goals met: 5 of 21
13. (board p5 a2 c2)
   deleted: (at p5 c2)
   added: (in p5 a2)
   goals met: 5 of 21
14. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 5 of 21
15. (fly a2 c2 c7 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c7) (fuel-level a2 f1)
   goals met: 5 of 21
16. (debark p5 a2 c7)
   deleted: (in p5 a2)
   added: (at p5 c7)
   goals met: 6 of 21
17. (fly a2 c7 c9 f1 f0)
   deleted: (at a2 c7) (fuel-level a2 f1)
   added: (at a2 c9) (fuel-level a2 f0)
   goals met: 6 of 21
18. (board p6 a2 c9)
   deleted: (at p6 c9)
   added: (in p6 a2)
   goals met: 6 of 21
19. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 6 of 21
20. (fly a2 c9 c2 f2 f1)
   deleted: (at a2 c9) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 6 of 21
21. (debark p6 a2 c2)
   deleted: (in p6 a2)
   added: (at p6 c2)
   goals met: 7 of 21
22. (fly a2 c2 c3 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 7 of 21
23. (board p7 a2 c3)
   deleted: (at p7 c3)
   added: (in p7 a2)
   goals met: 7 of 21
24. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 7 of 21
25. (fly a2 c3 c2 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 7 of 21
26. (debark p7 a2 c2)
   deleted: (in p7 a2)
   added: (at p7 c2)
   goals met: 8 of 21
27. (board p8 a1 c8)
   deleted: (at p8 c8)
   added: (in p8 a1)
   goals met: 8 of 21
28. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 21
29. (fly a1 c8 c1 f2 f1)
   deleted: (at a1 c8) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 7 of 21
30. (debark p8 a1 c1)
   deleted: (in p8 a1)
   added: (at p8 c1)
   goals met: 8 of 21
31. (fly a1 c1 c5 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 8 of 21
32. (board p9 a1 c5)
   deleted: (at p9 c5)
   added: (in p9 a1)
   goals met: 8 of 21
33. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 21
34. (fly a1 c5 c8 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c8) (fuel-level a1 f1)
   goals met: 9 of 21
35. (debark p9 a1 c8)
   deleted: (in p9 a1)
   added: (at p9 c8)
   goals met: 10 of 21
36. (board p10 a2 c2)
   deleted: (at p10 c2)
   added: (in p10 a2)
   goals met: 10 of 21
37. (fly a2 c2 c5 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c5) (fuel-level a2 f0)
   goals met: 10 of 21
38. (debark p10 a2 c5)
   deleted: (in p10 a2)
   added: (at p10 c5)
   goals met: 11 of 21
39. (fly a1 c8 c4 f1 f0)
   deleted: (at a1 c8) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 10 of 21
40. (board p11 a1 c4)
   deleted: (at p11 c4)
   added: (in p11 a1)
   goals met: 10 of 21
41. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 10 of 21
42. (fly a1 c4 c9 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c9) (fuel-level a1 f1)
   goals met: 10 of 21
43. (debark p11 a1 c9)
   deleted: (in p11 a1)
   added: (at p11 c9)
   goals met: 11 of 21
44. (fly a1 c9 c7 f1 f0)
   deleted: (at a1 c9) (fuel-level a1 f1)
   added: (at a1 c7) (fuel-level a1 f0)
   goals met: 11 of 21
45. (board p12 a1 c7)
   deleted: (at p12 c7)
   added: (in p12 a1)
   goals met: 11 of 21
46. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 11 of 21
47. (fly a1 c7 c6 f2 f1)
   deleted: (at a1 c7) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 11 of 21
48. (debark p12 a1 c6)
   deleted: (in p12 a1)
   added: (at p12 c6)
   goals met: 12 of 21
49. (board p13 a2 c5)
   deleted: (at p13 c5)
   added: (in p13 a2)
   goals met: 12 of 21
50. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 12 of 21
51. (fly a2 c5 c9 f2 f1)
   deleted: (at a2 c5) (fuel-level a2 f2)
   added: (at a2 c9) (fuel-level a2 f1)
   goals met: 12 of 21
52. (debark p13 a2 c9)
   deleted: (in p13 a2)
   added: (at p13 c9)
   goals met: 13 of 21
53. (board p14 a1 c6)
   deleted: (at p14 c6)
   added: (in p14 a1)
   goals met: 13 of 21
54. (fly a1 c6 c5 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 13 of 21
55. (debark p14 a1 c5)
   deleted: (in p14 a1)
   added: (at p14 c5)
   goals met: 14 of 21
56. (board p15 a3 c2)
   deleted: (at p15 c2)
   added: (in p15 a3)
   goals met: 14 of 21
57. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 14 of 21
58. (fly a3 c2 c9 f2 f1)
   deleted: (at a3 c2) (fuel-level a3 f2)
   added: (at a3 c9) (fuel-level a3 f1)
   goals met: 14 of 21
59. (debark p15 a3 c9)
   deleted: (in p15 a3)
   added: (at p15 c9)
   goals met: 15 of 21
60. (fly a2 c9 c8 f1 f0)
   deleted: (at a2 c9) (fuel-level a2 f1)
   added: (at a2 c8) (fuel-level a2 f0)
   goals met: 15 of 21
61. (board p16 a2 c8)
   deleted: (at p16 c8)
   added: (in p16 a2)
   goals met: 15 of 21
62. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 15 of 21
63. (fly a2 c8 c2 f2 f1)
   deleted: (at a2 c8) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 15 of 21
64. (debark p16 a2 c2)
   deleted: (in p16 a2)
   added: (at p16 c2)
   goals met: 16 of 21
65. (board p17 a2 c2)
   deleted: (at p17 c2)
   added: (in p17 a2)
   goals met: 16 of 21
66. (fly a2 c2 c6 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c6) (fuel-level a2 f0)
   goals met: 16 of 21
67. (debark p17 a2 c6)
   deleted: (in p17 a2)
   added: (at p17 c6)
   goals met: 17 of 21
68. (fly a3 c9 c2 f1 f0)
   deleted: (at a3 c9) (fuel-level a3 f1)
   added: (at a3 c2) (fuel-level a3 f0)
   goals met: 17 of 21
69. (board p18 a3 c2)
   deleted: (at p18 c2)
   added: (in p18 a3)
   goals met: 17 of 21
70. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 17 of 21
71. (fly a3 c2 c7 f2 f1)
   deleted: (at a3 c2) (fuel-level a3 f2)
   added: (at a3 c7) (fuel-level a3 f1)
   goals met: 17 of 21
72. (debark p18 a3 c7)
   deleted: (in p18 a3)
   added: (at p18 c7)
   goals met: 18 of 21
73. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 21
74. (fly a1 c5 c8 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c8) (fuel-level a1 f1)
   goals met: 19 of 21
75. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 19 of 21
76. (fly a2 c6 c1 f2 f1)
   deleted: (at a2 c6) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 20 of 21
77. (fly a3 c7 c5 f1 f0)
   deleted: (at a3 c7) (fuel-level a3 f1)
   added: (at a3 c5) (fuel-level a3 f0)
   goals met: 21 of 21
